// 一、将当前索引保存全局的便于后面切换上下歌曲

// 二、左-播放动画效果（1-清空之前的动画改成索引，2-当前的增加动画）

//  三、右-切换图片

// 四、播放音乐 && 播放图标▶️

var musicI
var videoObj=document.querySelector('video')
var musicObjs=document.querySelectorAll('.music .content .row')
musicObjs.forEach(function(item,i){
    item.onclick=function(){
        musicI=i
        musicObjs.forEach(function(row,rowI){
            row.querySelector('span:nth-of-type(1)').innerText=rowI+1
            row.style.color=''
        })
        var spanObj=item.querySelector('span:nth-of-type(1)')
        item.style.color='rgb(6,137,212)'
        spanObj.innerHTML='<i class="playing line1"></i><i class="playing line2"></i><i class="playing line3"></i>'
        var muName=musicObjs[i].getAttribute('name')
        var muImg=document.querySelector('.music .cover img')
        muImg.src='./assets/mp3/imgs/'+ muName+'.jpeg'
        document.querySelector('.player .play-pause-box i:nth-of-type(1)').style.display='none'
        document.querySelector('.player .play-pause-box i:nth-of-type(2)').style.display='block'

        videoObj.src='./assets/mp3/'+muName+'.mp3'
        videoObj.play()

        changeLrcFn()
    }
})

// 六、切换歌词 难
function changeLrcFn()
{
    var lrcs = [
        "[ti:七里香]\n[ar:周杰伦]\n[al:七里香]\n[by:]\n[offset:0]\n[00:00.00]七里香 - 周杰伦 (Jay Chou)\n[00:06.96]词：方文山\n[00:13.93]曲：周杰伦\n[00:20.90]编曲：钟兴民\n[00:27.87]窗外的麻雀在电线杆上多嘴\n[00:34.52]你说这一句很有夏天的感觉\n[00:41.23]手中的铅笔在纸上来来回回\n[00:47.58]我用几行字形容你是我的谁\n[00:53.33]\n[00:54.31]秋刀鱼的滋味猫跟你都想了解\n[01:01.65]初恋的香味就这样被我们寻回\n[01:07.74]那温暖的阳光像刚摘的鲜艳草莓\n[01:14.21]你说你舍不得吃掉这一种感觉\n[01:20.91]雨下整夜我的爱溢出就像雨水\n[01:27.67]院子落叶跟我的思念厚厚一叠\n[01:34.41]几句是非也无法将我的热情冷却\n[01:41.41]\n[01:41.95]你出现在我诗的每一页\n[01:48.11]雨下整夜我的爱溢出就像雨水\n[01:54.64]窗台蝴蝶像诗里纷飞的美丽章节\n[02:01.42]我接着写\n[02:03.91]把永远爱你写进诗的结尾\n[02:08.98]你是我唯一想要的了解\n[02:14.80]\n[02:42.26]雨下整夜我的爱溢出就像雨水\n[02:48.68]院子落叶跟我的思念厚厚一叠\n[02:55.43]几句是非也无法将我的热情冷却\n[03:03.03]你出现在我诗的每一页\n[03:08.79]\n[03:09.46]那饱满的稻穗幸福了这个季节\n[03:16.77]而你的脸颊像田里熟透的蕃茄\n[03:22.82]你突然对我说七里香的名字很美\n[03:29.27]我此刻却只想亲吻你倔强的嘴\n[03:35.97]雨下整夜我的爱溢出就像雨水\n[03:42.72]院子落叶跟我的思念厚厚一叠\n[03:49.43]几句是非也无法将我的热情冷却\n[03:56.90]你出现在我诗的每一页\n[04:02.76]\n[04:03.50]整夜我的爱溢出就像雨水\n[04:09.58]窗台蝴蝶像诗里纷飞的美丽章节\n[04:16.66]我接着写\n[04:18.42]\n[04:18.93]把永远爱你写进诗的结尾\n[04:24.01]你是我唯一想要的了解",
        '[00:01.28]《太阳人》\n[00:01.88]（中央电视台《第一动画乐园》主题曲）\n[00:02.53]第一动画乐园《太阳人》演唱者 合唱 中央少年广播合唱团\n[00:03.21]\n[00:04.00]乐队：洲际爱乐乐团\n[00:04.83]独唱：杨梓煊\n[00:05.74]作曲：张镒麟\n[00:06.64]作词：刘健  \n[00:07.50]\n[00:28.00]太阳人 太阳人\n[00:32.01]圆圆的肚子大大的眼\n[00:35.39]太阳人 太阳人\n[00:38.65]快乐满满的男子汉\n[00:42.08]星宝儿蹦蹦跳\n[00:45.69]月宝儿慢摇摇\n[00:48.98]大头儿子小头爸爸\n[00:50.94]小猪熊 白龙马 小鲤鱼\n[00:53.56]都在动画乐园\n[00:55.38]当星星飞满天当太阳照\n[00:59.35]蓝天和白云伴着绿草\n[01:02.74]风儿吹着小伙伴\n[01:06.18]太阳人星宝和月宝\n[01:09.63]随着笑声一起跳\n[01:13.06]太阳人张开温暖怀抱\n[01:16.43]不要哭要大声笑\n[01:19.94]快乐满天跑\n[01:24.04]\n[01:43.88]太阳人 太阳人\n[01:47.25]圆圆的肚子大大的眼\n[01:50.80]太阳人 太阳人\n[01:54.08]快乐满满的男子汉\n[01:57.51]星宝儿蹦蹦跳\n[02:01.08]月宝儿慢摇摇\n[02:04.44]大头儿子小头爸爸\n[02:06.29]小猪熊 白龙马 小鲤鱼\n[02:08.96]都在动画乐园\n[02:10.86]当星星飞满天当太阳照\n[02:14.62]蓝天和白云伴着绿草\n[02:18.19]风儿吹着小伙伴\n[02:21.65]太阳人星宝和月宝\n[02:25.06]随着笑声一起跳\n[02:28.48]太阳人张开温暖怀抱\n[02:31.82]不要哭要大声笑\n[02:35.28]快乐满天跑\n[02:39.36]',
        '[ti:夜空中最亮的星 (《摘星的你》微电影主题曲)]\n[ar:逃跑计划]\n[al:世界]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 - 逃跑计划 (Escape Plan)\n[00:06.08]词：逃跑计划\n[00:12.17]曲：逃跑计划\n[00:18.25]夜空中最亮的星 能否听清\n[00:24.66]\n[00:27.01]那仰望的人 心底的孤独和叹息\n[00:33.60]\n[00:35.89]Oh 夜空中最亮的星 能否记起\n[00:42.58]\n[00:44.80]曾与我同行 消失在风里的身影\n[00:50.61]\n[00:52.52]我祈祷拥有一颗透明的心灵\n[00:57.66]和会流泪的眼睛\n[01:01.01]\n[01:03.21]给我再去相信的勇气\n[01:06.51]Oh 越过谎言去拥抱你\n[01:10.49]每当我找不到存在的意义\n[01:15.31]每当我迷失在黑夜里\n[01:18.93]\n[01:19.60]Oh 夜空中最亮的星\n[01:24.26]请指引我靠近你\n[01:28.20]\n[01:38.30]夜空中最亮的星 是否知道\n[01:44.88]\n[01:46.94]曾与我同行的身影 如今在哪里\n[01:52.84]\n[01:55.93]Oh 夜空中最亮的星 是否在意\n[02:02.39]\n[02:04.38]是等太阳升起 还是意外先来临\n[02:10.64]\n[02:12.45]我宁愿所有痛苦都留在心里\n[02:17.55]也不愿忘记你的眼睛\n[02:21.35]\n[02:23.18]给我再去相信的勇气\n[02:26.40]Oh 越过谎言去拥抱你\n[02:30.64]每当我找不到存在的意义\n[02:35.27]每当我迷失在黑夜里\n[02:39.79]Oh 夜空中最亮的星\n[02:44.15]Oh 请照亮我前行\n[02:48.20]\n[03:06.13]我祈祷拥有一颗透明的心灵\n[03:11.02]和会流泪的眼睛\n[03:14.63]\n[03:16.51]给我再去相信的勇气\n[03:19.68]Oh 越过谎言去拥抱你\n[03:22.74]\n[03:23.83]每当我找不到存在的意义\n[03:28.70]每当我迷失在黑夜里\n[03:32.16]\n[03:33.09]Oh 夜空中最亮的星\n[03:37.49]Oh 请照亮我前行\n[03:43.10]\n[03:51.37]夜空中最亮的星 能否听清\n[03:58.03]\n[04:00.22]那仰望的人 心底的孤独和叹息',
        '[ti:]\n[ar:]\n[al:]\n[by:九九Lrc歌词网～www.99Lrc.net]\n[00:00.85]地球妈妈别哭泣\n[00:02.42]\n[00:04.29]作词：曹沁芳\n[00:06.17]作曲：曹沁芳\n[00:08.19]演唱：中央少年广播合唱团、檀欢、乐晓露\n[00:10.00]\n[00:25.82]是谁在哭泣\n[00:31.40]是谁在哭泣\n[00:37.11]哦  哭泣\n[00:42.17]您为什么哭泣\n[00:46.68]\n[00:47.74]孩子啊\n[00:52.55]我以为自己无限宽广\n[00:57.76]不在乎失去一片荫凉\n[01:03.40]我以为自己无穷宝藏\n[01:09.43]不在乎掠走一片安详\n[01:13.53]\n[01:13.78]我以为自己无比坚强\n[01:20.27]可如今泪在心里流淌\n[01:25.63]我以为自己母爱无疆\n[01:32.99]谁知已渐渐失去力量\n[01:41.09]\n[01:41.66]地球妈妈在哭泣在哭泣\n[01:46.91]灰色的上衣让您伤心不已\n[01:52.20]曾经的碧水蓝天多美丽\n[01:57.57]花香迷醉人神气\n[02:02.54]\n[02:03.05]地球妈妈别哭泣别哭泣\n[02:08.78]是孩儿让您让您憔悴不已\n[02:14.00]静心反思一个沉重的话题\n[02:19.36]一个沉重的话题\n[02:24.38]\n[02:24.84]地球妈妈在哭泣在哭泣\n[02:30.26]灰色的上衣让您伤心不已\n[02:35.83]曾经的碧水蓝天多美丽\n[02:41.31]花香迷醉人神气\n[02:45.95]\n[02:46.46]地球妈妈别哭泣别哭泣\n[02:51.83]是孩儿让您让您憔悴不已\n[02:57.26]静心反思一个沉重的话题\n[03:03.08]一个沉重的话题\n[03:08.55]还人类一个纯净的气息\n[03:13.66]哦  地球妈妈别哭泣别哭泣\n[03:24.67]我们和您同命运共呼吸',
    
        "[ti:七里香]\n[ar:周杰伦]\n[al:七里香]\n[by:]\n[offset:0]\n[00:00.00]七里香 - 周杰伦 (Jay Chou)\n[00:06.96]词：方文山\n[00:13.93]曲：周杰伦\n[00:20.90]编曲：钟兴民\n[00:27.87]窗外的麻雀在电线杆上多嘴\n[00:34.52]你说这一句很有夏天的感觉\n[00:41.23]手中的铅笔在纸上来来回回\n[00:47.58]我用几行字形容你是我的谁\n[00:53.33]\n[00:54.31]秋刀鱼的滋味猫跟你都想了解\n[01:01.65]初恋的香味就这样被我们寻回\n[01:07.74]那温暖的阳光像刚摘的鲜艳草莓\n[01:14.21]你说你舍不得吃掉这一种感觉\n[01:20.91]雨下整夜我的爱溢出就像雨水\n[01:27.67]院子落叶跟我的思念厚厚一叠\n[01:34.41]几句是非也无法将我的热情冷却\n[01:41.41]\n[01:41.95]你出现在我诗的每一页\n[01:48.11]雨下整夜我的爱溢出就像雨水\n[01:54.64]窗台蝴蝶像诗里纷飞的美丽章节\n[02:01.42]我接着写\n[02:03.91]把永远爱你写进诗的结尾\n[02:08.98]你是我唯一想要的了解\n[02:14.80]\n[02:42.26]雨下整夜我的爱溢出就像雨水\n[02:48.68]院子落叶跟我的思念厚厚一叠\n[02:55.43]几句是非也无法将我的热情冷却\n[03:03.03]你出现在我诗的每一页\n[03:08.79]\n[03:09.46]那饱满的稻穗幸福了这个季节\n[03:16.77]而你的脸颊像田里熟透的蕃茄\n[03:22.82]你突然对我说七里香的名字很美\n[03:29.27]我此刻却只想亲吻你倔强的嘴\n[03:35.97]雨下整夜我的爱溢出就像雨水\n[03:42.72]院子落叶跟我的思念厚厚一叠\n[03:49.43]几句是非也无法将我的热情冷却\n[03:56.90]你出现在我诗的每一页\n[04:02.76]\n[04:03.50]整夜我的爱溢出就像雨水\n[04:09.58]窗台蝴蝶像诗里纷飞的美丽章节\n[04:16.66]我接着写\n[04:18.42]\n[04:18.93]把永远爱你写进诗的结尾\n[04:24.01]你是我唯一想要的了解",
        '[00:01.28]《太阳人》\n[00:01.88]（中央电视台《第一动画乐园》主题曲）\n[00:02.53]第一动画乐园《太阳人》演唱者 合唱 中央少年广播合唱团\n[00:03.21]\n[00:04.00]乐队：洲际爱乐乐团\n[00:04.83]独唱：杨梓煊\n[00:05.74]作曲：张镒麟\n[00:06.64]作词：刘健  \n[00:07.50]\n[00:28.00]太阳人 太阳人\n[00:32.01]圆圆的肚子大大的眼\n[00:35.39]太阳人 太阳人\n[00:38.65]快乐满满的男子汉\n[00:42.08]星宝儿蹦蹦跳\n[00:45.69]月宝儿慢摇摇\n[00:48.98]大头儿子小头爸爸\n[00:50.94]小猪熊 白龙马 小鲤鱼\n[00:53.56]都在动画乐园\n[00:55.38]当星星飞满天当太阳照\n[00:59.35]蓝天和白云伴着绿草\n[01:02.74]风儿吹着小伙伴\n[01:06.18]太阳人星宝和月宝\n[01:09.63]随着笑声一起跳\n[01:13.06]太阳人张开温暖怀抱\n[01:16.43]不要哭要大声笑\n[01:19.94]快乐满天跑\n[01:24.04]\n[01:43.88]太阳人 太阳人\n[01:47.25]圆圆的肚子大大的眼\n[01:50.80]太阳人 太阳人\n[01:54.08]快乐满满的男子汉\n[01:57.51]星宝儿蹦蹦跳\n[02:01.08]月宝儿慢摇摇\n[02:04.44]大头儿子小头爸爸\n[02:06.29]小猪熊 白龙马 小鲤鱼\n[02:08.96]都在动画乐园\n[02:10.86]当星星飞满天当太阳照\n[02:14.62]蓝天和白云伴着绿草\n[02:18.19]风儿吹着小伙伴\n[02:21.65]太阳人星宝和月宝\n[02:25.06]随着笑声一起跳\n[02:28.48]太阳人张开温暖怀抱\n[02:31.82]不要哭要大声笑\n[02:35.28]快乐满天跑\n[02:39.36]',
        '[ti:夜空中最亮的星 (《摘星的你》微电影主题曲)]\n[ar:逃跑计划]\n[al:世界]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 - 逃跑计划 (Escape Plan)\n[00:06.08]词：逃跑计划\n[00:12.17]曲：逃跑计划\n[00:18.25]夜空中最亮的星 能否听清\n[00:24.66]\n[00:27.01]那仰望的人 心底的孤独和叹息\n[00:33.60]\n[00:35.89]Oh 夜空中最亮的星 能否记起\n[00:42.58]\n[00:44.80]曾与我同行 消失在风里的身影\n[00:50.61]\n[00:52.52]我祈祷拥有一颗透明的心灵\n[00:57.66]和会流泪的眼睛\n[01:01.01]\n[01:03.21]给我再去相信的勇气\n[01:06.51]Oh 越过谎言去拥抱你\n[01:10.49]每当我找不到存在的意义\n[01:15.31]每当我迷失在黑夜里\n[01:18.93]\n[01:19.60]Oh 夜空中最亮的星\n[01:24.26]请指引我靠近你\n[01:28.20]\n[01:38.30]夜空中最亮的星 是否知道\n[01:44.88]\n[01:46.94]曾与我同行的身影 如今在哪里\n[01:52.84]\n[01:55.93]Oh 夜空中最亮的星 是否在意\n[02:02.39]\n[02:04.38]是等太阳升起 还是意外先来临\n[02:10.64]\n[02:12.45]我宁愿所有痛苦都留在心里\n[02:17.55]也不愿忘记你的眼睛\n[02:21.35]\n[02:23.18]给我再去相信的勇气\n[02:26.40]Oh 越过谎言去拥抱你\n[02:30.64]每当我找不到存在的意义\n[02:35.27]每当我迷失在黑夜里\n[02:39.79]Oh 夜空中最亮的星\n[02:44.15]Oh 请照亮我前行\n[02:48.20]\n[03:06.13]我祈祷拥有一颗透明的心灵\n[03:11.02]和会流泪的眼睛\n[03:14.63]\n[03:16.51]给我再去相信的勇气\n[03:19.68]Oh 越过谎言去拥抱你\n[03:22.74]\n[03:23.83]每当我找不到存在的意义\n[03:28.70]每当我迷失在黑夜里\n[03:32.16]\n[03:33.09]Oh 夜空中最亮的星\n[03:37.49]Oh 请照亮我前行\n[03:43.10]\n[03:51.37]夜空中最亮的星 能否听清\n[03:58.03]\n[04:00.22]那仰望的人 心底的孤独和叹息',
        '[ti:]\n[ar:]\n[al:]\n[by:九九Lrc歌词网～www.99Lrc.net]\n[00:00.85]地球妈妈别哭泣\n[00:02.42]\n[00:04.29]作词：曹沁芳\n[00:06.17]作曲：曹沁芳\n[00:08.19]演唱：中央少年广播合唱团、檀欢、乐晓露\n[00:10.00]\n[00:25.82]是谁在哭泣\n[00:31.40]是谁在哭泣\n[00:37.11]哦  哭泣\n[00:42.17]您为什么哭泣\n[00:46.68]\n[00:47.74]孩子啊\n[00:52.55]我以为自己无限宽广\n[00:57.76]不在乎失去一片荫凉\n[01:03.40]我以为自己无穷宝藏\n[01:09.43]不在乎掠走一片安详\n[01:13.53]\n[01:13.78]我以为自己无比坚强\n[01:20.27]可如今泪在心里流淌\n[01:25.63]我以为自己母爱无疆\n[01:32.99]谁知已渐渐失去力量\n[01:41.09]\n[01:41.66]地球妈妈在哭泣在哭泣\n[01:46.91]灰色的上衣让您伤心不已\n[01:52.20]曾经的碧水蓝天多美丽\n[01:57.57]花香迷醉人神气\n[02:02.54]\n[02:03.05]地球妈妈别哭泣别哭泣\n[02:08.78]是孩儿让您让您憔悴不已\n[02:14.00]静心反思一个沉重的话题\n[02:19.36]一个沉重的话题\n[02:24.38]\n[02:24.84]地球妈妈在哭泣在哭泣\n[02:30.26]灰色的上衣让您伤心不已\n[02:35.83]曾经的碧水蓝天多美丽\n[02:41.31]花香迷醉人神气\n[02:45.95]\n[02:46.46]地球妈妈别哭泣别哭泣\n[02:51.83]是孩儿让您让您憔悴不已\n[02:57.26]静心反思一个沉重的话题\n[03:03.08]一个沉重的话题\n[03:08.55]还人类一个纯净的气息\n[03:13.66]哦  地球妈妈别哭泣别哭泣\n[03:24.67]我们和您同命运共呼吸',
    
        "[ti:七里香]\n[ar:周杰伦]\n[al:七里香]\n[by:]\n[offset:0]\n[00:00.00]七里香 - 周杰伦 (Jay Chou)\n[00:06.96]词：方文山\n[00:13.93]曲：周杰伦\n[00:20.90]编曲：钟兴民\n[00:27.87]窗外的麻雀在电线杆上多嘴\n[00:34.52]你说这一句很有夏天的感觉\n[00:41.23]手中的铅笔在纸上来来回回\n[00:47.58]我用几行字形容你是我的谁\n[00:53.33]\n[00:54.31]秋刀鱼的滋味猫跟你都想了解\n[01:01.65]初恋的香味就这样被我们寻回\n[01:07.74]那温暖的阳光像刚摘的鲜艳草莓\n[01:14.21]你说你舍不得吃掉这一种感觉\n[01:20.91]雨下整夜我的爱溢出就像雨水\n[01:27.67]院子落叶跟我的思念厚厚一叠\n[01:34.41]几句是非也无法将我的热情冷却\n[01:41.41]\n[01:41.95]你出现在我诗的每一页\n[01:48.11]雨下整夜我的爱溢出就像雨水\n[01:54.64]窗台蝴蝶像诗里纷飞的美丽章节\n[02:01.42]我接着写\n[02:03.91]把永远爱你写进诗的结尾\n[02:08.98]你是我唯一想要的了解\n[02:14.80]\n[02:42.26]雨下整夜我的爱溢出就像雨水\n[02:48.68]院子落叶跟我的思念厚厚一叠\n[02:55.43]几句是非也无法将我的热情冷却\n[03:03.03]你出现在我诗的每一页\n[03:08.79]\n[03:09.46]那饱满的稻穗幸福了这个季节\n[03:16.77]而你的脸颊像田里熟透的蕃茄\n[03:22.82]你突然对我说七里香的名字很美\n[03:29.27]我此刻却只想亲吻你倔强的嘴\n[03:35.97]雨下整夜我的爱溢出就像雨水\n[03:42.72]院子落叶跟我的思念厚厚一叠\n[03:49.43]几句是非也无法将我的热情冷却\n[03:56.90]你出现在我诗的每一页\n[04:02.76]\n[04:03.50]整夜我的爱溢出就像雨水\n[04:09.58]窗台蝴蝶像诗里纷飞的美丽章节\n[04:16.66]我接着写\n[04:18.42]\n[04:18.93]把永远爱你写进诗的结尾\n[04:24.01]你是我唯一想要的了解",
        '[00:01.28]《太阳人》\n[00:01.88]（中央电视台《第一动画乐园》主题曲）\n[00:02.53]第一动画乐园《太阳人》演唱者 合唱 中央少年广播合唱团\n[00:03.21]\n[00:04.00]乐队：洲际爱乐乐团\n[00:04.83]独唱：杨梓煊\n[00:05.74]作曲：张镒麟\n[00:06.64]作词：刘健  \n[00:07.50]\n[00:28.00]太阳人 太阳人\n[00:32.01]圆圆的肚子大大的眼\n[00:35.39]太阳人 太阳人\n[00:38.65]快乐满满的男子汉\n[00:42.08]星宝儿蹦蹦跳\n[00:45.69]月宝儿慢摇摇\n[00:48.98]大头儿子小头爸爸\n[00:50.94]小猪熊 白龙马 小鲤鱼\n[00:53.56]都在动画乐园\n[00:55.38]当星星飞满天当太阳照\n[00:59.35]蓝天和白云伴着绿草\n[01:02.74]风儿吹着小伙伴\n[01:06.18]太阳人星宝和月宝\n[01:09.63]随着笑声一起跳\n[01:13.06]太阳人张开温暖怀抱\n[01:16.43]不要哭要大声笑\n[01:19.94]快乐满天跑\n[01:24.04]\n[01:43.88]太阳人 太阳人\n[01:47.25]圆圆的肚子大大的眼\n[01:50.80]太阳人 太阳人\n[01:54.08]快乐满满的男子汉\n[01:57.51]星宝儿蹦蹦跳\n[02:01.08]月宝儿慢摇摇\n[02:04.44]大头儿子小头爸爸\n[02:06.29]小猪熊 白龙马 小鲤鱼\n[02:08.96]都在动画乐园\n[02:10.86]当星星飞满天当太阳照\n[02:14.62]蓝天和白云伴着绿草\n[02:18.19]风儿吹着小伙伴\n[02:21.65]太阳人星宝和月宝\n[02:25.06]随着笑声一起跳\n[02:28.48]太阳人张开温暖怀抱\n[02:31.82]不要哭要大声笑\n[02:35.28]快乐满天跑\n[02:39.36]',
        '[ti:夜空中最亮的星 (《摘星的你》微电影主题曲)]\n[ar:逃跑计划]\n[al:世界]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 - 逃跑计划 (Escape Plan)\n[00:06.08]词：逃跑计划\n[00:12.17]曲：逃跑计划\n[00:18.25]夜空中最亮的星 能否听清\n[00:24.66]\n[00:27.01]那仰望的人 心底的孤独和叹息\n[00:33.60]\n[00:35.89]Oh 夜空中最亮的星 能否记起\n[00:42.58]\n[00:44.80]曾与我同行 消失在风里的身影\n[00:50.61]\n[00:52.52]我祈祷拥有一颗透明的心灵\n[00:57.66]和会流泪的眼睛\n[01:01.01]\n[01:03.21]给我再去相信的勇气\n[01:06.51]Oh 越过谎言去拥抱你\n[01:10.49]每当我找不到存在的意义\n[01:15.31]每当我迷失在黑夜里\n[01:18.93]\n[01:19.60]Oh 夜空中最亮的星\n[01:24.26]请指引我靠近你\n[01:28.20]\n[01:38.30]夜空中最亮的星 是否知道\n[01:44.88]\n[01:46.94]曾与我同行的身影 如今在哪里\n[01:52.84]\n[01:55.93]Oh 夜空中最亮的星 是否在意\n[02:02.39]\n[02:04.38]是等太阳升起 还是意外先来临\n[02:10.64]\n[02:12.45]我宁愿所有痛苦都留在心里\n[02:17.55]也不愿忘记你的眼睛\n[02:21.35]\n[02:23.18]给我再去相信的勇气\n[02:26.40]Oh 越过谎言去拥抱你\n[02:30.64]每当我找不到存在的意义\n[02:35.27]每当我迷失在黑夜里\n[02:39.79]Oh 夜空中最亮的星\n[02:44.15]Oh 请照亮我前行\n[02:48.20]\n[03:06.13]我祈祷拥有一颗透明的心灵\n[03:11.02]和会流泪的眼睛\n[03:14.63]\n[03:16.51]给我再去相信的勇气\n[03:19.68]Oh 越过谎言去拥抱你\n[03:22.74]\n[03:23.83]每当我找不到存在的意义\n[03:28.70]每当我迷失在黑夜里\n[03:32.16]\n[03:33.09]Oh 夜空中最亮的星\n[03:37.49]Oh 请照亮我前行\n[03:43.10]\n[03:51.37]夜空中最亮的星 能否听清\n[03:58.03]\n[04:00.22]那仰望的人 心底的孤独和叹息',
        '[ti:]\n[ar:]\n[al:]\n[by:九九Lrc歌词网～www.99Lrc.net]\n[00:00.85]地球妈妈别哭泣\n[00:02.42]\n[00:04.29]作词：曹沁芳\n[00:06.17]作曲：曹沁芳\n[00:08.19]演唱：中央少年广播合唱团、檀欢、乐晓露\n[00:10.00]\n[00:25.82]是谁在哭泣\n[00:31.40]是谁在哭泣\n[00:37.11]哦  哭泣\n[00:42.17]您为什么哭泣\n[00:46.68]\n[00:47.74]孩子啊\n[00:52.55]我以为自己无限宽广\n[00:57.76]不在乎失去一片荫凉\n[01:03.40]我以为自己无穷宝藏\n[01:09.43]不在乎掠走一片安详\n[01:13.53]\n[01:13.78]我以为自己无比坚强\n[01:20.27]可如今泪在心里流淌\n[01:25.63]我以为自己母爱无疆\n[01:32.99]谁知已渐渐失去力量\n[01:41.09]\n[01:41.66]地球妈妈在哭泣在哭泣\n[01:46.91]灰色的上衣让您伤心不已\n[01:52.20]曾经的碧水蓝天多美丽\n[01:57.57]花香迷醉人神气\n[02:02.54]\n[02:03.05]地球妈妈别哭泣别哭泣\n[02:08.78]是孩儿让您让您憔悴不已\n[02:14.00]静心反思一个沉重的话题\n[02:19.36]一个沉重的话题\n[02:24.38]\n[02:24.84]地球妈妈在哭泣在哭泣\n[02:30.26]灰色的上衣让您伤心不已\n[02:35.83]曾经的碧水蓝天多美丽\n[02:41.31]花香迷醉人神气\n[02:45.95]\n[02:46.46]地球妈妈别哭泣别哭泣\n[02:51.83]是孩儿让您让您憔悴不已\n[02:57.26]静心反思一个沉重的话题\n[03:03.08]一个沉重的话题\n[03:08.55]还人类一个纯净的气息\n[03:13.66]哦  地球妈妈别哭泣别哭泣\n[03:24.67]我们和您同命运共呼吸',
    ]

    // console.log(lrcs[musicI].split('\n'));
    // 1 定义空数组存放 一个个对象  {time, content}
    // 2 遍历歌词提取time content push到空数组中
    var lrcFilter = lrcs[musicI].split('\n').map(item => {
        // [02:48.68]院子落叶跟我的思念厚厚一叠
        // [02:55.43]几句是非也无法将我的热情冷却
        // console.log(item);
        var temp = item.split(']')   //  ['[02:48.68', '院子落叶跟我的思念厚厚一叠] 
        var timeArr = temp[0].replace('[', '').split(':')

        return {
            time: timeArr[0]*60+parseFloat(timeArr[1]),
            content: temp[1]
        }
    })

    // console.log(lrcFilter);
    // 切记：上述为啥组装这个数据格式 没有对和错  
    // 然后：也不存在为啥 或者 必须这样么
    // 最终：都是铺垫 只要你能把歌词通过 li的方式追加到ul中就行

    // 切记切记切记：每次点击网页都没有刷新
    // 因此：先清空
    document.querySelector('.music .cover ul').innerHTML = ''
    // 然后：再追加
    lrcFilter.forEach((item,i) => {
        var liObj = document.createElement('li')
        if (i===0) liObj.className = 'active'
        liObj.innerText = item.content
        document.querySelector('.music .cover ul').appendChild(liObj)
    })


    // 同步歌词
    videoObj.ontimeupdate = function() {
        // console.log('实时监控歌曲播放进度：', videoObj.currentTime)
        // console.log(lrcFilter);

        // 特殊：推荐用for循环 因为找到符合条件的就break退出 forEach不支持break
        // 一、找到播放进度索引
        var findIndex = 0
        for (var i=lrcFilter.length-1; i>=0; i--)
        {
            // 当前5s
            // 1
            // 2
            // 3
            // 4  
            // 5  滚动到这个歌词
            // 10
            // 50
            // 60
            // if (当前播放的歌曲+提前.5s看歌词 >= lrcFilter[i].time)
            if ((videoObj.currentTime+.5) >= lrcFilter[i].time)
            {
                findIndex = i 
                break
            }
        }
        // console.log(findIndex);
        // 二、高亮歌词 & 滚动到高亮位置
        if (lrcFilter[findIndex].content)
        {
            // 高亮歌词
            document.querySelector('.music .cover ul li.active').className = ''
            document.querySelector(`.music .cover ul li:nth-of-type(${findIndex+1})`).className = 'active'
            // 滚动到高亮位置
            document.querySelector(`.music .cover ul`).style.marginTop = -(findIndex)*40 + 'px'
        }

        // 同步播放进度
        // var m = Math.floor(videoObj.currentTime/60)
        // var s = parseInt(videoObj.currentTime - m*60)
        // document.querySelector('.player .current').innerText = `${String(m).padStart(2,0)}:${String(s).padStart(2,0)}`

        // if (videoObj.duration)
        // {
        //     var m = Math.floor(videoObj.duration/60)
        //     var s = Math.floor(videoObj.duration - m*60)
        //     var totalPlay = String(m).padStart(2, 0) + ':' + String(s).padStart(2, 0)
        //     document.querySelector('.player .duration').innerText = totalPlay 

        //     // 同步进度条
        //     var w = window.innerWidth || document.documentElement.clientWidth
        //     document.querySelector('.player .play-bar .progress').style.width =  w / (videoObj.duration / videoObj.currentTime) + 'px'
        //     document.querySelector('.player .play-bar .bar').style.left =  w / (videoObj.duration / videoObj.currentTime) + 'px'
        // }
    }
}
































//播放按钮
var playObj=document.querySelector('.player .play-pause-box')
playObj.onclick=function(){
    console.log(videoObj.paused)
    
    if(videoObj.paused){
        //已暂停
        document.querySelector('.player .play-pause-box i:nth-of-type(1)').style.display='none'
        document.querySelector('.player .play-pause-box i:nth-of-type(2)').style.display='block'  
        videoObj.play()  
    }else{
        //z正在播放
        document.querySelector('.player .play-pause-box i:nth-of-type(1)').style.display='block'
        document.querySelector('.player .play-pause-box i:nth-of-type(2)').style.display='none'    
        videoObj.pause()  
    }
}

//拖拽进度条
var barObj=document.querySelector('.player .bar')
barObj.onmousedown=function(){
    document.onmousemove=function(evt){
        var e=evt || window.event
        var bLeft=e.pageX-barObj.offsetWidth/2
        var maxL=window.innerWidth ||document.documentElement.clientWidth-barObj.offsetWidth/2
        if(bLeft>=maxL) bLeft=maxL
        if(bLeft<=0) bLeft=0
        barObj.style.left=bLeft+'px'

        document.querySelector('.player .progress').style.width = bLeft+'px'

        // mp3总播放时间       进度条总宽度
        // -------------- = -----------
        //  播放的时间          拖拽的长度

        
        videoObj.currentTime = videoObj.duration / (maxL/bLeft)
    }
    document.onmouseup=function(){
        document.onmousemove=null 
    }
}